define(function(require){

  var data = [
    {
        ttl  : "Code Editor【Flash】"
      , color: "蝙蝠侠"
      , desc : "用<span class='emphasize'>AS3</span>做了一个简单的代码编辑器，提供一些简单的语法高亮和代码提示的功能。完全是用正则来实现的(惭愧)。"
    }
    , {
        ttl  : "TwitWar【C++】"
      , color: "浩克"
      , desc : "基于<span class='emphasize'>Qt框架</span>的一个桌面应用。通过<span class='emphasize'>插件</span>的方式来让用户收取豆瓣/微博/饭否等信息。甚至能检测Gmail新邮件，orz=3 。。。"
      , link : "https://code.google.com/p/twitwarreborn/"
    }
    , {
        ttl  : "MetalBone【C++】"
      , color: "闪电侠"
      , desc : "受Qt启发的一个轻量级<span class='sub-emph'>Windows</span> <span class='emphasize'>DirectUI库</span>。利用GDI、Direct2D、Skia来绘图。主要负责<span class='emphasize'>交互处理</span>、<span class='emphasize'>重绘处理</span>和<span class='emphasize'>CSS管理样式</span>等功能。"
      , link : "https://github.com/WarWithinMe/MetalBone"
    }
    , {
        ttl  : "HuamiM【Obj-C】"
      , color: "美队"
      , desc : "<span class='emphasize'>花密</span>是一个密码生成工具，这个是它的<span class='sub-emph'>OSX</span>版本。"
      , link : "http://flowerpassword.com/app/mac"
    }
    , {
        ttl  : "xVim【Obj-C】"
      , color: "超人"
      , desc : "为<span class='sub-emph'>XCode</span>提供Vim模拟。由于有另外一个叫做XVim的项目提供了更丰富的feature，所以这个项目终止了。"
      , link : "https://github.com/WarWithinMe/xVim"
    }
    , {
        ttl  : "CodeRunner"
      , color: "金刚狼"
      , desc : "一个简单的SublimeText插件。可以把当前文件（JS、Ruby、Python等）当做脚本运行，然后显示输出结果。"
      , link : "https://github.com/WarWithinMe/Sublime-CodeRunner"
    }
    , {
        ttl  : "grunt-seajs-build"
      , color: "石头人"
      , desc : "一个Grunt任务，用于构建<span class='emphasize'>Sea.js</span>项目。可以对CMD模块进行<span class='emphasize'>ID、依赖提取</span>和<span class='emphasize'>模块合并</span>"
      , link : "https://npmjs.org/package/grunt-seajs-build"
    }
  ];


  var Rect   = require("src/canvas/rect.js");
  var Path   = require("src/canvas/path.js");
  var Circle = require("src/canvas/circle.js");
  var Text   = require("src/canvas/text.js");

  data[0].setupCanvas = function ( canvas ) {

    var els = [];
    var el;

    el = new Path("M0 20l9 0l0 100l-9 0l0-100M14 11l40 0l0 10l-40 0l0-10m0 36l40 0l0 10l-40 0l0-10M24 23l30 0l0 10l-30 0l0-10m0 36l15 0l0 10l-15 0l0-10");
    el.attrs.fill = "#142f5b";
    els[0] = el;

    el = new Path("M59 23l25 0l0 10l-25 0l0-10M44 59l30 0l0 10l-30 0l0-10");
    el.attrs.fill = "#000";
    els[1] = el;

    el = new Path("M59 11l45 0l0 10l-45 0l0-10m0 36l40 0l0 10l-40 0l0-10M14 35l5 0l0 10l-5 0l0-10m0 60l5 0l0 10l-5 0l0-10M104 47l5 0l0 10l-5 0l0-10M79 59l5 0l0 10l-5 0l0-10m10 0l15 0l0 10l-15 0l0-10");
    el.attrs.fill = "#35383a";
    els[2] = el;

    el = new Path("M2 23l5 0l0 10l-5 0l0-10m0 12l5 0l0 10l-5 0l0-10m0 12l5 0l0 10l-5 0l0-10m0 12l5 0l0 10l-5 0l0-10m0 12l5 0l0 10l-5 0l0-10m0 12l5 0l0 10l-5 0l0-10m0 12l5 0l0 10l-5 0l0-10");
    el.attrs.fill = "#0f213d";
    els[3] = el;

    // New enter text
    el = new Rect(24, 71, 0, 10);
    el.d(10).c({width:5}).d(200).c({width:10}).d(200).c({width:15}).d(100).c({width:35}).d(1000);
    el.attrs.fill = "#142f5b";
    els[4] = el;

    // Popup
    el = new Rect(32, 76, 60, 44);
    el.attrs.fill    = "#142e5b";
    el.attrs.visible = false;
    el.d(10).c({visible:true})
      .d(200).c({x:37})
      .d(200).c({x:42})
      .d(100).c({visible:false}).d(100);
    els[5] = el;

    // Selection
    el = new Rect(32, 77, 60, 14);
    el.attrs.fill = "#f9df0a";
    el.attrs.visible = false;
    el.d(10).c({visible:true})
      .d(200).c({x:37})
      .d(200).c({x:42,y:91})
      .d(100).c({visible:false}).d(100);
    els[6] = el;

    // Popup text
    el = new Path("M35 79l20 0l0 10l-20 0l0-10m0 14l35 0l0 10l-35 0l0-10m0 14l25 0l0 10l-25 0l0-10");
    el.attrs.fill = "#000";
    el.attrs.visible = false;
    el.d(10).c({visible:true})
      .d(200).c({translate:{x:5,y:0}})
      .d(200).c({translate:{x:10,y:0}})
      .d(100).c({visible:false}).d(100);
    els[7] = el;

    canvas.addNode(els).background = "#191b1e";
  }

  data[1].setupCanvas = function ( canvas ) {

    var els = [];
    var el;

    // Frame
    el = new Rect(10, 68, 100, 150);
    el.attrs.fill = "#9fb536";
    el.t({y:34}, 700, "easeInOutCubic").d(1000);
    els[0] = el;

    // Contents
    // Avatar
    el = new Path("M15 73l24 0l0 24l-24 0l0-24m0 34l24 0l0 24l-24 0l0-24m0 34l24 0l0 24l-24 0l0-24m0 34l24 0l0 24l-24 0l0-24");
    el.attrs.fill = "#2f3913";
    el.t({translate:{x:0, y:-110}}, 700, "easeInOutCubic").d(1000);
    els[1] = el;

    // Seperate
    el = new Path("M12 100l96 0l0 1l-96 0l0-1m0 34l96 0l0 1l-96 0l0-1m0 34l96 0l0 1l-96 0l0-1");
    el.attrs.fill = "#688025";
    el.t({translate:{x:0, y:-110}}, 700, "easeInOutCubic").d(1000);
    els[2] = el;

    // Content
    el = new Path("M44 73l60 0l0 6l-60 0l0-6m0 8l60 0l0 6l-60 0l0-6m0 8l20 0l0 6l-20 0l0-6m0 18l60 0l0 6l-60 0l0-6m0 8l45 0l0 6l-45 0l0-6m0 26l60 0l0 6l-60 0l0-6m0 8l60 0l0 6l-60 0l0-6m0 8l45 0l0 6l-45 0l0-6m0 18l40 0l0 6l-40 0l0-6m0 8l60 0l0 6l-60 0l0-6m0 11l0 45l60 0l0-45l-60 0a13 11 6 0 360 0m-13 30l18-21l8 13l13-18l12 20l0 6l-51 0");
    el.attrs.fill = "#dfec7f";
    el.t({translate:{x:0, y:-110}}, 700, "easeInOutCubic").d(1000);
    els[3] = el;

    // Title
    el = new Rect(10, 50, 100, 18);
    el.attrs.fill = "#6a8526";
    el.t({y:16}, 800, "easeInOutCubic").d(1000);
    els[4] = el;

    // Logo
    el = new Rect(14, 54, 22, 10);
    el.attrs.fill = "#dfec7f";
    el.t({y:20}, 800, "easeInOutCubic").d(1000);
    els[5] = el;

    // Cover
    el = new Rect(10, 0, 100, 50);
    el.attrs.fill = "#8656bf";
    el.t({y:-34}, 800, "easeInOutCubic").d(1000);
    els[6] = el;

    canvas.addNode(els).background = "#8656bf";
  }

  data[2].setupCanvas = function ( canvas ) {

    var els = [];
    var el;

    el = new Path("M30 42l70 0l0 8l-70 0l0-8m0 20l70 0l0 8l-70 0l0-8m0 20l30 0l0 8l-30 0l0-8m50 0l30 0l0 8l-30 0l0-8");
    el.attrs.fill = "#a52425";
    els[0] = el;

    el = new Path("M14 40l8 0r2 0 0 2 2l0 8r0 2-2 0 2l-8 0r-2 0 0-2 2l0-8r0-2 2 0 2m0 20l8 0r2 0 0 2 2l0 8r0 2-2 0 2l-8 0r-2 0 0-2 2l0-8r0-2 2 0 2M18 86A18 86 6 0 360 1A70 86 6 0 360 1");
    el.attrs.fill = "#f4c509";
    els[1] = el;

    // Button
    el = Path.RoundRect(50, 17, 4);
    el.attrs.x = 35;
    el.attrs.y = 102;
    el.attrs.fill = "#f4c609";
    el.d(1200).c({fill:"#fff000"}).d(1000);
    els[2] = el;

    // LOGO
    el = new Path("M27.572,24.331 C26.494,26.199 24.106,26.838 22.239,25.76 C21.001,25.039 20.255,23.693 20.293,22.263 L20.291,22.262 C20.227,20.872 19.524,19.725 18.342,19.002 L9.737,14.034 L9.737,14.035 C8.678,13.434 7.381,13.357 6.261,13.838 C5.631,14.108 5.443,14.36 4.644,14.508 C3.709,14.682 2.788,14.472 1.953,14.048 C0.085,12.97 -0.554,10.582 0.524,8.715 C1.602,6.848 3.99,6.208 5.857,7.286 C3.99,6.208 3.35,3.82 4.428,1.953 C5.506,0.085 7.894,-0.554 9.761,0.524 C10.723,1.105 11.435,2.062 11.646,3.175 C11.704,3.48 11.691,3.697 11.706,3.985 C11.726,4.364 11.776,4.728 11.892,5.091 C12.188,6.018 12.816,6.767 13.641,7.272 L13.641,7.272 L22.246,12.24 C23.198,12.783 24.343,12.912 25.388,12.577 C26.123,12.342 26.476,11.956 27.31,11.789 C28.26,11.598 29.196,11.805 30.047,12.236 C31.915,13.314 32.554,15.702 31.476,17.569 C30.398,19.436 28.01,20.076 26.143,18.998 C28.01,20.076 28.65,22.464 27.572,24.331");

    el.attrs.fill      = "#fff";
    el.attrs.scale     = { x : 0.6, y : 0.6 };
    el.attrs.translate = { x : 51, y : 7 };
    els[3] = el;

    // Check 1
    el = new Rect( 15, 43, 6, 6 );
    el.attrs.fill    = "#a52425";
    el.attrs.visible = false;
    el.d(420).c({visible:true}).d(1000);
    els[4] = el;

    // Check 2
    el = new Circle( 18, 86, 3 );
    el.attrs.fill    = "#a52425";
    el.attrs.visible = false;
    el.d(920).c({visible:true}).d(1000);
    els[5] = el;

    // Cursor
    el = new Path("M21.372,6.037 C23.85,9.512 23.163,11.959 25.658,15.457 C22.517,17.697 19.348,19.957 16.04,22.316 C10.849,18.449 6.368,17.209 4.921,16.722 C3.542,16.259 2.651,15.374 2.958,14.264 C3.268,13.141 4.442,12.807 5.41,12.851 C6.87,12.917 8.055,13.355 8.055,13.355 L1.347,3.951 C0.748,3.111 0.944,1.946 1.783,1.347 C2.622,0.749 3.788,0.943 4.386,1.783 L8.929,8.142 C9.148,8.449 9.574,8.52 9.881,8.301 C10.188,8.082 10.26,7.656 10.041,7.349 L8.921,5.779 C9.427,5.65 10.042,5.496 10.723,5.33 C11.195,5.215 11.69,5.399 11.972,5.794 L12.889,7.079 C13.108,7.386 13.534,7.457 13.841,7.239 C14.148,7.019 14.22,6.593 14.001,6.286 L12.942,4.802 C13.527,4.667 14.123,4.533 14.712,4.405 C15.176,4.305 15.656,4.491 15.931,4.877 L16.71,5.968 C16.928,6.275 17.355,6.347 17.662,6.128 C17.969,5.909 18.04,5.482 17.821,5.175 L16.949,3.952 C17.126,3.919 17.3,3.888 17.469,3.859 C19.285,3.542 20.267,4.488 21.372,6.037");
    el.attrs.fill    = "#fff";
    el.attrs.visible = false;
    el.attrs.scale   = { x : 0.6, y : 0.6 };
    el.attrs.translate = { x : 120, y : 100 };
    el.d(10).c({visible:true})
      .t({ translate : {x:16,y:45} }, 390, "easeInOutCubic")
      .d(100)
      .t({ translate : {x:19,y:85} }, 400, "easeInOutCubic")
      .d(100)
      .t({ translate : {x:50,y:110}}, 300, "easeInOutCubic")
      .d(100);
    els[6] = el;

    data[2].__cursor = el;

    canvas.addNode(els).background = "#f25050";
  }
  data[2].onMove = function (x, y) { data[2].__cursor.attrs.translate = { x : x, y : y }; }


  data[3].setupCanvas = function ( canvas ) {

    var els = [];
    var el;

    // Frame
    el = Path.RoundRect( 104, 64, 4 );
    el.attrs.fill = "#254aab";
    el.attrs.translate = { x : 8, y : 37 };
    els[0] = el;

    // Input
    el = new Path("M14 47l92 0l0 12l-92 0l0-12m0 18l92 0l0 12l-92 0l0-12");
    el.attrs.fill = "#4fa9e0";
    els[1] = el;

    // ID
    el = new Rect(34, 49, 0, 8);
    el.attrs.fill = "#cd222b";
    el.d(90).c({width:10}).d(90).c({width:20})
      .d(90).c({width:30}).d(90).c({width:40})
      .d(90).c({width:50}).d(90).c({width:60})
      .d(90).c({width:70}).d(90);
    els[2] = el;

    // Password
    el = new Rect(34, 67, 0, 8);
    el.attrs.fill = "#cd222b";
    el.d(720).c({width:10}).d(90).c({width:20})
      .d(90 ).c({width:30}).d(90).c({width:40})
      .d(90 ).c({width:50}).d(90).c({width:60})
      .d(90 ).c({width:70}).d(1000);
    els[3] = el;

    // Generation
    var colors = ["#3572cc", "#cd222b", "#fff", "#4fa9e0", "#ae141e"];
    for ( var i = 0; i < 9; ++i ) {
      el = new Rect(16 + i * 10, 85, 8, 10);
      el.attrs.visible = false;
      els[els.length] = el.d(720).c({ visible : true });

      for ( var j = 0; j < 7; ++j ) {
        el.c({ fill : colors[Math.floor(Math.random()*5)] })
          .d(90);
      }
    }

    canvas.addNode(els).background = "#4fa9e0";
  }

  data[4].setupCanvas = function ( canvas ) {
    var els = [];
    var el  = new Rect(0,0,120,33);
    el.attrs.fill = "#1f2224";
    els[0] = el;

    el = new Path("A23 20 7 0 360 1A40 20 7 0 360 1M46 47l35 0l0 10l-35 0l0-10m0 15l25 0l0 10l-25 0l0-10");
    el.attrs.fill = "#f4c609";
    els[1] = el;

    el = new Rect(71,62,8,10);
    el.attrs.fill = "#c41c06";
    el.attrs.visible = false;
    el.d(300).c({ visible : true }).d(300);
    els[2] = el;

    el = Path.RoundRect( 59, 15, 4 );
    el.attrs.translate = {x:54, y:12};
    el.attrs.fill = "#f4c609";
    els[3] = el;

    el = new Path("M60 23l29 0l0 2l-29 0l0-2M0 33l36 0l0 97l-36 0l0-97");
    el.attrs.fill = "#ea370b";
    els[4] = el;

    el = new Rect(36,33,84,5);
    el.attrs.fill = "#c41c06";
    els[5] = el;

    el = new Path("M89 23l10 0l0 2l-10 0l0-2M37 17l6 0l0 6l-6 0l0-6M27 20l-5 5l0-10");
    el.attrs.fill = "#1f2224";
    els[6] = el;

    canvas.addNode(els).background = "#2449aa";
  }

  data[5].setupCanvas = function( canvas ) {

    var els = [];
    var el = new Path("M0 0l48 6l5 18l28-13l39 0l0 59l-120 0l0-70");
    el.attrs.fill = "#f8dd0d";
    els[0] = el;

    el = new Rect(0, 70, 120, 5);
    el.attrs.fill = "#c41c06";
    els[1] = el;

    el = new Rect(8, 38, 55, 10);
    el.attrs.fill = "#bd8d07";
    els[2] = el;

    el = new Text("S", "14px Helvetica,Arial");
    el.attrs.x = 60;
    el.attrs.y = 3;
    el.attrs.fill = "#f8dd0d";
    els[3] = el;

    el = new Rect(8, 50, 0, 10);
    el.attrs.fill = "#bd8d07";
    el.d(125).c({width:10}).d(125).c({width:20})
      .d(125).c({width:30}).d(125).c({width:40}).d(100);
    els[4] = el;

    el = Path.RoundRect( 54, 22, 4 );
    el.attrs.x = 33;
    el.attrs.y = 59;
    el.attrs.fill = "#080808";
    el.attrs.alpha = 0;
    el.d(550).t({alpha:1}, 250).d(500).c({alpha:0}).d(100);
    els[5] = el;

    el = new Text("⌘+R", "14px Helvetica,Arial");
    el.textBaseline  = "middle";
    el.attrs.x       = "60";
    el.attrs.y       = "70";
    el.attrs.fill    = "#f8dd0d";
    el.attrs.alpha = 0;
    el.d(550).t({alpha:1}, 250).d(500).c({alpha:0}).d(100);
    els[6] = el;

    el = new Path("M8 83l50 0l0 10l-50 0l0-10m0 12l80 0l0 10l-80 0l0-10m0 12l70 0l0 10l-70 0l0-10");
    el.attrs.fill = "#3266cc";
    el.attrs.visible = false;
    el.d(900).c({visible:true}).d(1000);
    els[7] = el;

    canvas.addNode(els).background = "#1f2224";
  }

  data[6].setupCanvas = function ( canvas ) {
    var els = [];
    var el;

    el = new Rect(0, 97, 120, 50);
    el.attrs.fill = "#3572cc";
    els[0] = el;

    el = new Circle(88, 97, 12);
    el.attrs.fill = "#2449aa";
    els[1] = el;

    el = new Circle(88, 97, 9);
    el.attrs.fill = "#fff";
    els[2] = el;

    el = new Text("Sea", "9px Helvetica,Arial");
    el.textBaseline = "middle";
    el.attrs.fill = "#2449aa";
    el.attrs.x = 88;
    el.attrs.y = 97;
    els[3] = el;

    // Grunt Icon
    el = new Path("M36.354 108.194c-8.504-1.707-11.704-6.04-13.768-10.504-14.942-4.761-10.733-24.21-5.551-26.146.888 3.574 1.545 6.175 5.329 8.939-.064-6.772 2-15.347-1.553-18.326-1.778-1.043-8.152-4.104-9.994-7.152-1.693-4.237-.824-8.422 3.997-10.279.675-3.791.329-7.09.277-8.051-7.459-11.248 2.24-13.105 4.672-12.888 1.851-7.818-5.171-8.932-8.724-9.678 9.03-11.62 22.048-3.285 26.647 3.352.009.231 1.109-.222 1.109-.222-.148-2.533 1.556-8.271 5.997-10.057.146 3.278.73 5.431 1.775 5.811.01-.069-.601-5.743 7.772-8.493-.951 4.997.362 6.921.666 7.598.899-.514 2.508-3.358 7.106-3.13-1.471 2.467-2.377 7.072-1.997 7.823.231.306 2.432.961 2.219.894 3.933-7.815 19.161-14.459 26.425-3.576-7.392 1.05-9.771 4.098-8.438 9.609 4.59 0 11.39 3.942 4.219 12.964-.361 2.612.064 4.536.666 8.044 12 7.531-1.787 15.562-5.996 16.985-1.247 1.572-1.712 3.345-2.22 4.468-.064 10.065.803 10.348.888 14.08 1.121-.588 4.654-4.178 5.054-9.122 10.732 11.986.721 25.064-5.498 26.553-.887.895-3.258 8.875-14.196 10.618-2.597 2.35-14.533 8.147-26.883-.114z");
    el.attrs.fill  = "#462F13";
    el.attrs.scale = { x:0.5, y:0.5 };
    el.attrs.translate = { x : 3, y : 33 };
    els[4] = el;

    el = new Path("M50.12 43.831c-2.981.128-5.55-3.512-5.55-3.574.338.195.655.432 1.013.586 2.01.868 1.868.704 3.951.946.597-.046 1.199-.049 1.791-.139 1.531-.232 3.027-.815 4.346-1.617 0 0-2.569 3.672-5.551 3.798zm-17.215 60.564c-1-1.902-2.331-4.189-2.665-5.139 0 0-3.276-.222-3.775-.448-.499-.225 3.054 4.36 6.44 5.587zm33.973-.222c3.361-1.227 6.889-5.807 6.392-5.58-.496.226-3.747.446-3.747.446-.33.949-1.652 3.232-2.645 5.134zm-26.867-4.471c-2.72-.052-5.164-4.582-5.33-5.138-.167-1.005.276-1.792 1.331-1.79 1.057.003 6.996-.002 7.996 0 1.023.003 1.387.95 1.11 1.565-.389 1.174-2.055 5.249-5.107 5.363zm19.985 0c-2.72-.052-5.164-4.582-5.331-5.138-.167-1.005.279-1.792 1.334-1.79 1.055.003 6.994-.002 7.994 0 1.023.003 1.386.95 1.109 1.565-.388 1.174-2.054 5.249-5.106 5.363zm-8 9.668c3.271-.698 4.225-.637 7.111-2.216 4.505-2.464 7.294-6.955 8.883-11.698 1.775-5.253-2.833-6.031-3.775-6.033h-19.904l-1.615-.002c-2.302 0-4.604 0-6.906.002 0 0-5.383.114-4.219 4.916 1.365 5.047 4.164 10.035 8.76 12.814 2.866 1.732 6.123 2.478 9.449 2.382zm16.703-89.301c.172-.293.325-.596.515-.878 1.743-2.588 4.397-4.556 7.506-5.142.853-.161 1.731-.153 2.596-.23l1.448.096s1.295-.668 1.998-1.114c-3.28-1.624-7.255-1.495-10.488.226-2.638 1.404-4.716 3.574-6.388 6.015 1.11.295 2.073.741 2.666 1.336zm4.959 4.544c.815-.149 1.407-.261 2.444-.446 1.331-1.67.222-5.313 2.219-8.024-.266-.001-.538-.065-.797-.004-.666.155-1.348.314-1.947.644-2.17 1.195-3.593 3.225-4.14 5.602.89.446 1.629 1.187 2.221 2.228zm-42.191-4.246c.593-.595 1.556-1.044 2.666-1.341-1.371-1.847-1.831-2.627-3.821-4.309-3.625-3.064-8.737-4.129-13.055-1.948.703.446 1.998 1.116 1.998 1.116l1.448-.096c.866.077 1.743.069 2.597.23 3.506.663 6.631 3.148 8.167 6.348zm-5.106 4.246c.592-1.043 1.331-1.787 2.221-2.235-.659-2.467-1.812-4.331-4.14-5.616-.598-.331-1.281-.491-1.947-.646-.259-.061-.531.003-.797.004 1.997 2.721.888 6.37 2.219 8.047 1.037.185 1.629.297 2.444.446zm38.194 62.127s-4.841-15.148-4.663-18.772c2.75 5.03 4.396 10.612 6.66 15.863 2.807-.155 5.912-.237 8.438-1.561-1.421-9.346-1.021-14.258-.666-16.761-.176-3.844 3.331-6.033 3.331-6.033 7.55-4.649 8.484-5.32 8.66-7.823.178-2.503-1.732-4.067-2.441-4.246-.179.716.443 2.906.443 2.906s-5.596-6.525-2.221-17.878c.055.897.088 1.799.212 2.69 1.204-1.86 2.326-3.994 2.231-6.266-4.418-6.783-21.332 3.654-25.981 7.823 3.526-7.507 11.325-10.953 11.325-10.953-15.189-13.139-39.258-3.038-39.969 0 7.639 3.576 11.547 10.953 11.547 10.953s-11.991-10.461-22.65-9.834c-6.839.895-1.11 8.044-1.11 8.044s-.222-3.306.222-2.681c3.286 13.499-2.443 18.102-2.443 18.102s1.244-3.933 0-2.682c-4.53 4.649.178 7.285.887 8.269 4.709 2.681 8.573 4.022 9.55 9.833 0 10.012-.622 13.72-.888 16.761 2.663.733 5.406 1.096 8.154 1.336h.062c2.16-5.337 4.109-10.81 6.884-15.862-1.334 10.547-5.109 18.772-5.108 18.772zm-25.538-26.818s1.206-5.139-.443-6.479c-1.678.867-2.322 1.358-4.495 1.509-4.339.303-8.062-3.351-9.232-7.271-.198-.661-.273-1.355-.334-2.043-.026-.303.048-.608.072-.912-.89.766-1.111 3.349-1.111 3.351-2.856-4.848.825-6.461.443-6.479-.379-.02-1.455-.4-2.663-.894 2.591-.24 2.702-.329 4.531-.197 9.449 3.239 10.042 4.121 11.821 5.937 1.319 1.346 2.104 2.409 3.912 3.105.608.235 1.289.198 1.933.297 1.869-.232 1.058-.061 2.451-.428.508 3.832-4.155 4.025-4.219 4.025-.064 4.086-2.666 6.479-2.666 6.479zm22.05.006s-2.602-2.393-2.666-6.479c-.064 0-4.727-.193-4.219-4.025 1.393.367.582.196 2.451.428.644-.099 1.325-.062 1.933-.297 1.808-.696 2.593-1.759 3.912-3.105 1.779-1.816 2.372-2.698 4.641-4.042 2.372-1.405 5.351-1.763 7.18-1.895 1.83-.132 1.94-.043 4.531.197-1.208.494-2.284.874-2.663.894-.382.018 3.299 1.631.443 6.479 0-.002-.221-2.585-1.111-3.351.024.304.098.609.072.912-.061.688-.136 1.382-.334 2.043-1.17 3.92-4.893 7.574-9.232 7.271-2.173-.151-2.817-.642-4.495-1.509-1.649 1.34-.443 6.479-.443 6.479z");
    el.attrs.fill  = "#f3a540";
    el.attrs.scale = { x:0.5, y:0.5 };
    el.attrs.translate = { x : 3, y : 33 };
    els[5] = el;

    el = new Path("M28.582 95.903c-4.595-.822-8.33-1.513-11.332-5.546-2.734-3.674-2.184-8.828-1.326-13.004 1.795 4.552 5.312 6.842 9.844 8.198 2.022.606 4.091.762 6.143 1.189-.887 1.341-4.441 4.247-3.329 9.163zm42.624-.224c1.107-4.917-2.435-7.822-3.32-9.163 1.247-.246 2.512-.36 3.759-.619 3.517-.731 7.177-1.987 9.691-4.702 1.588-1.715 1.699-2.259 2.489-4.064 1.129 5.03 1.314 11.259-3.028 14.918-2.731 2.301-5.81 3.017-9.221 3.547zm-4.684-42.914c-1.512.062-3.37-.416-4.189-1.116.945-2.235 6.489-6.859 9.259-7.818.351 2.193.687 5.336-1.077 7.079-1.205 1.19-1.866 1.181-3.437 1.665zm-33.025 0c-1.532-.487-2.788-.665-3.993-1.855-1.783-1.761-1.399-4.869-1.077-7.079 2.77.959 8.314 5.583 9.259 7.818-.819.7-2.677 1.178-4.189 1.116z");
    el.attrs.fill = "#fff";
    el.attrs.scale = { x:0.5, y:0.5 };
    el.attrs.translate = { x : 3, y : 33 };
    els[6] = el;

    // Gears BG
    el = new Rect(84, 34, 28, 28);
    el.attrs.fill = "#462f13";
    els[7] = el;

    // Gears
    var gearPath = "M-.169 10.234c5.257 0 9.714-4.628 9.714-10.162 0-5.536-4.457-10.026-9.714-10.026-5.253 0-9.513 4.49-9.513 10.026 0 5.534 4.26 10.162 9.513 10.162zm-.584 19.266c-3.188 0-4.879-7.342-5.034-8.053-1.873-.557-3.624-1.396-5.242-2.439l.503.566s-5.762 4.992-8.573 2.028l-1.244-1.09c-2.243-2.364 1.525-8.881 1.929-9.556-.817-1.524-1.486-3.145-1.952-4.86-.711-.177-7.634-1.955-7.634-5.304v-1.437c0-3.822 6.458-5.013 7.605-5.193.454-1.732 1.121-3.364 1.936-4.895-.32-.481-4.531-6.879-2.252-9.28l1.314-1.163c2.574-2.716 8.011 1.256 8.917 1.952 1.474-.888 3.047-1.61 4.721-2.106.287-1.275 1.964-8.17 5.006-8.17h1.365c3.466 0 4.661 6.452 4.909 8.117 1.703.486 3.305 1.209 4.802 2.098 1.053-.681 6.693-4.178 8.836-1.917l1.243 1.385c2.466 2.594-1.142 7.713-2.077 8.945.855 1.587 1.543 3.289 2.014 5.087l.004-.092s7.657 1.041 7.657 5.232v1.437c0 3.132-6.286 4.904-7.699 5.26-.49 1.835-1.205 3.563-2.094 5.169l.137-.132s4.457 5.996 1.642 8.958l-1.381 1.458c-2.116 2.229-7.254-1.246-8.334-2.018-1.615.952-3.365 1.689-5.208 2.174l.516.016s-.989 7.823-4.967 7.823z";
    el = new Path(gearPath);
    el.attrs.scale = {x:0.3,y:0.3};
    el.attrs.translate = {x:93,y:55};
    el.attrs.fill  = "#f3a540";
    el.t({rotate:-360}, 1200);
    els[8] = el;

    el = new Path(gearPath);
    el.attrs.scale = {x:0.3,y:0.3};
    el.attrs.translate = {x:104,y:42};
    el.attrs.rotate = 15;
    el.attrs.fill  = "#f3a540";
    el.t({rotate:375}, 1200);
    els[9] = el;

    // Gears Cover
    el = new Path("M84 34l28 0l0 28l-28 0l0-28a14 14 12 0 360 1");
    el.attrs.fill = "#462f13";
    els[10] = el;

    el = new Path("M80 30l36 0l0 36l-36 0l0-36a18 18 14 0 360 1");
    el.attrs.fill = "#f3a540";
    els[11] = el;

    // Lines
    el = new Path("M50 40l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15");
    el.attrs.fill = "#4fa9e0";
    el.attrs.translate = { x:-36, y : 0 };
    el.clip( new Path("M50 40l32 0l0 15l-32 0l0-15") );
    el.t({translate:{x:0,y:0}}, 1200);
    els[12] = el;

    el = new Path("M75 50l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15m9 0l5 0l0 15l-5 0l0-15");
    el.attrs.fill = "#4fa9e0";
    el.attrs.rotate = 20;
    el.clip( new Path("M53 71.5l24.432 8.893l-5.814 15.975l-24.432-8.893") );
    el.t({translate:{x:-36*0.93969,y:-36*0.34202}}, 1200);
    els[13] = el;

    canvas.addNode(els).background = "#f3a540";
  }

  return data;
});
